{
  "users": [
    {
      "nickname": "pepe",
      "email": "aca@gmail.com",
      "password": "aca",
      "promoCode": "BlLsdT3w",
      "peso": "59",
      "altura": "171",
      "imc": "",
      "kcal": "1500",
      "cesta": [
        "010",
        "012"
      ],
      "listaDeseos": [],
      "id": "1",
      "compras": [
        "751501640078"
      ]
    },
    {
      "nickname": "prueba",
      "email": "prueba@gmail.com",
      "password": "prueba",
      "promoCode": "T46Ksxux",
      "peso": "",
      "altura": "",
      "imc": "",
      "kcal": "",
      "cesta": [
        "012",
        "010"
      ],
      "listaDeseos": [],
      "id": "2",
      "compras": []
    }
  ],
  "compras": [
    {
      "id": "e3d0",
      "fecha": "25/03/2024",
      "numPedido": "751501640078",
      "precio": "12.58"
    }
  ],
  "productos": [
    {
      "id": "001",
      "nombre": "Proteína en Polvo",
      "nombre_detallado": "Proteína en Polvo de Suero de Leche",
      "descripcion": "Suplemento de proteína en polvo de suero de leche, ideal para la construcción muscular y la recuperación después del ejercicio.",
      "precio": 29.99,
      "img": "proteina.png",
      "etiqueta": "Proteína",
      "promocion": false,
      "novedad": false
    },
    {
      "id": "002",
      "nombre": "Barra Energética",
      "nombre_detallado": "Barra Energética de Avena y Frutos Secos",
      "descripcion": "Barra energética hecha con ingredientes naturales como avena, almendras, nueces y pasas, perfecta como refrigerio antes o después del entrenamiento.",
      "precio": 2.99,
      "img": "barra_energetica.png",
      "etiqueta": "Musculación",
      "promocion": false,
      "novedad": false
    },
    {
      "id": "003",
      "nombre": "Batido de Proteínas",
      "nombre_detallado": "Batido de Proteínas Sabor Vainilla",
      "descripcion": "Delicioso batido de proteínas con sabor a vainilla, perfecto para después del entrenamiento para recuperar energía y nutrir los músculos.",
      "precio": 24.99,
      "img": "batido_proteinas.png",
      "etiqueta": "Recuperación",
      "promocion": false,
      "novedad": false
    },
    {
      "id": "004",
      "nombre": "Snack de Frutos Secos",
      "nombre_detallado": "Mezcla de Frutos Secos con Pasas",
      "descripcion": "Mezcla de frutos secos y pasas con un toque de sal, ideal como un snack saludable para cualquier momento del día.",
      "precio": 4.49,
      "img": "snack_frutos_secos.png",
      "etiqueta": "Proteína",
      "promocion": false,
      "novedad": false
    },
    {
      "id": "005",
      "nombre": "Barras de Proteínas",
      "nombre_detallado": "Pack de Barras de Proteínas Variadas",
      "descripcion": "Pack variado de barras de proteínas con sabores como chocolate, vainilla y fresa, perfectas para llevar como refrigerio después del ejercicio.",
      "precio": 12.99,
      "img": "barras_proteinas.png",
      "etiqueta": "Musculación",
      "promocion": false,
      "novedad": false
    },
    {
      "id": "006",
      "nombre": "Suplemento de Creatina",
      "nombre_detallado": "Polvo de Creatina Monohidratada",
      "descripcion": "Suplemento en polvo de creatina monohidratada, ideal para mejorar el rendimiento deportivo y la recuperación muscular.",
      "precio": 17.99,
      "img": "suplemento_creatina.png",
      "etiqueta": "Recuperación",
      "promocion": false,
      "novedad": false
    },
    {
      "id": "007",
      "nombre": "Botella de Agua Deportiva",
      "nombre_detallado": "Botella de Agua Deportiva de 1 litro",
      "descripcion": "Botella de agua deportiva resistente y reutilizable, con capacidad de 1 litro, perfecta para mantenerse hidratado durante el ejercicio.",
      "precio": 5.49,
      "img": "botella_agua.png",
      "etiqueta": "Proteína",
      "promocion": false,
      "novedad": false
    },
    {
      "id": "008",
      "nombre": "Mezcla de Frutos Secos y Chocolate",
      "nombre_detallado": "Mezcla de Frutos Secos con Trozos de Chocolate",
      "descripcion": "Mezcla de frutos secos como almendras, nueces y avellanas con trozos de chocolate negro, una combinación perfecta de energía y sabor.",
      "precio": 6.99,
      "img": "mezcla_frutos_chocolate.png",
      "etiqueta": "Musculación",
      "promocion": false,
      "novedad": false
    },
    {
      "id": "009",
      "nombre": "Polvo de Proteína Vegana",
      "nombre_detallado": "Polvo de Proteína Vegana Sabor a Chocolate",
      "descripcion": "Suplemento en polvo de proteína vegana con un delicioso sabor a chocolate, ideal para personas que siguen una dieta vegetariana o vegana.",
      "precio": 21.99,
      "img": "proteina_vegana.png",
      "etiqueta": "Recuperación",
      "promocion": false,
      "novedad": true
    },
    {
      "id": "010",
      "nombre": "Galletas de Avena y Plátano",
      "nombre_detallado": "Galletas de Avena y Plátano sin Azúcar",
      "descripcion": "Galletas saludables hechas con avena, plátano maduro y sin añadir azúcar, perfectas para un tentempié nutritivo y delicioso.",
      "precio": 3.99,
      "img": "galletas_avena_platano.png",
      "etiqueta": "Proteína",
      "promocion": true,
      "novedad": false
    },
    {
      "id": "011",
      "nombre": "Suplemento de Omega-3",
      "nombre_detallado": "Cápsulas de Omega-3 con Aceite de Pescado",
      "descripcion": "Suplemento en cápsulas de omega-3 con aceite de pescado de alta calidad, ideal para promover la salud del corazón y las articulaciones.",
      "precio": 14.99,
      "img": "suplemento_omega3.png",
      "etiqueta": "Musculación",
      "promocion": false,
      "novedad": true
    },
    {
      "id": "012",
      "nombre": "Crema de Almendras Natural",
      "nombre_detallado": "Crema de Almendras 100% Natural",
      "descripcion": "Deliciosa crema de almendras sin añadir azúcar ni aceites añadidos, perfecta para untar en tostadas o agregar a batidos y recetas.",
      "precio": 9.99,
      "img": "crema_almendras.png",
      "etiqueta": "Recuperación",
      "promocion": true,
      "novedad": false
    },
    {
      "id": "013",
      "nombre": "Pack de Muesli",
      "nombre_detallado": "Pack de Muesli Variado para Desayunos",
      "descripcion": "Pack variado de muesli con ingredientes como copos de avena, frutos secos y semillas, perfecto para un desayuno nutritivo y saludable.",
      "precio": 11.49,
      "img": "pack_muesli.png",
      "etiqueta": "Proteína",
      "promocion": false,
      "novedad": true
    },
    {
      "id": "014",
      "nombre": "Té Verde Matcha",
      "nombre_detallado": "Té Verde Matcha en Polvo Orgánico",
      "descripcion": "Té verde matcha en polvo de origen orgánico, rico en antioxidantes y energizante, ideal para preparar bebidas calientes o frías.",
      "precio": 18.99,
      "img": "te_matcha.png",
      "etiqueta": "Musculación",
      "promocion": true,
      "novedad": false
    }
  ],
  "dietas": [
    {
      "id": "1",
      "nombre": "Dieta Mediterránea",
      "descripcion": "Prepara un plato con una base de aceitunas, tomates y aceite de oliva. Acompaña con pescado grillado sazonado con hierbas mediterráneas como el romero y el tomillo. Sirve junto con una porción de verduras asadas o al vapor, como calabacín, berenjena y pimientos.",
      "etiqueta": "Mediterránea",
      "img": "Dieta1.png"
    },
    {
      "id": "2",
      "nombre": "Dieta Rica en Proteínas",
      "descripcion": "Prepara una pechuga de pollo a la parrilla sazonada con limón, ajo y hierbas. Acompaña con quinoa cocida al vapor y espárragos asados con aceite de oliva y sal. Sirve caliente y disfruta de una comida rica en proteínas y nutrientes.",
      "etiqueta": "Rica en Proteínas",
      "img": "Dieta2.png"
    },
    {
      "id": "3",
      "nombre": "Dieta Cetogénica",
      "descripcion": "Desayuna con huevos revueltos con aguacate y bacon. Almuerza una ensalada de espinacas con salmón ahumado y adereza con aceite de oliva y limón. Cena una tortilla de espinacas y queso feta. Mantén la ingesta de carbohidratos baja y la de grasas y proteínas alta para entrar en cetosis.",
      "etiqueta": "Sin Gluten",
      "img": "Dieta3.png"
    },
    {
      "id": "4",
      "nombre": "Dieta Vegetariana",
      "descripcion": "Prepara una ensalada fresca con una variedad de hojas verdes como lechuga, espinacas y rúcula. Agrega tomates cherry, nueces picadas y trozos de queso feta. Aliña con una vinagreta de aceite de oliva, vinagre balsámico y mostaza. Sirve con pan integral tostado y disfruta de una comida vegetariana y saludable.",
      "etiqueta": "Mediterránea",
      "img": "Dieta4.png"
    },
    {
      "id": "5",
      "nombre": "Dieta Rica en Grasas",
      "descripcion": "Cocina un filete de salmón al horno con rodajas de limón y hierbas frescas como el eneldo y el perejil. Acompaña con una guarnición de aguacate rebanado y almendras tostadas. Rocía con un chorrito de aceite de oliva extra virgen y salpica con semillas de sésamo. Disfruta de una comida rica en grasas saludables y omega-3.",
      "etiqueta": "Rica en Proteínas",
      "img": "Dieta5.png"
    },
    {
      "id": "6",
      "nombre": "Dieta DASH",
      "descripcion": "Cocina un filete de pollo a la parrilla sazonado con hierbas como el tomillo y el romero. Acompaña con una guarnición de brócoli al vapor y batatas asadas al horno con una pizca de canela. Disfruta de una comida baja en sodio y rica en nutrientes.",
      "etiqueta": "Sin Gluten",
      "img": "Dieta6.png"
    },
    {
      "id": "7",
      "nombre": "Dieta Atkins",
      "descripcion": "Prepara una hamburguesa casera con carne magra de res sazonada con especias como la pimienta negra y el ajo en polvo. Acompaña con lonchas de queso cheddar, rodajas de tomate, aguacate y hojas de lechuga. Sirve sin pan y disfruta de una comida baja en carbohidratos y rica en proteínas.",
      "etiqueta": "Mediterránea",
      "img": "Dieta7.png"
    },
    {
      "id": "8",
      "nombre": "Dieta Rica en Carbohidratos",
      "descripcion": "Cocina pasta integral al dente y sirve con una salsa casera de tomate, cebolla y champiñones. Acompaña con una ensalada fresca de hojas verdes, pepino y pimientos. Sirve con pan integral recién horneado y disfruta de una comida satisfactoria y llena de energía.",
      "etiqueta": "Rica en Proteínas",
      "img": "Dieta8.png"
    },
    {
      "id": "9",
      "nombre": "Dieta de la Zona",
      "descripcion": "Prepara una porción equilibrada de pechuga de pollo a la plancha con arroz integral cocido y verduras al vapor como brócoli y zanahorias. Aliña con un chorrito de aceite de oliva y una pizca de sal. Disfruta de una comida que sigue la proporción adecuada de carbohidratos, proteínas y grasas.",
      "etiqueta": "Sin Gluten",
      "img": "Dieta9.png"
    },
    {
      "id": "10",
      "nombre": "Dieta Flexitaria",
      "descripcion": "Marina cubos de tofu en una mezcla de salsa de soja, jengibre rallado y ajo picado. Asa en una sartén caliente hasta que estén dorados y crujientes. Acompaña con verduras asadas como pimientos, calabacín y champiñones, y una porción de quinoa cocida. Disfruta de una comida flexible y nutritiva.",
      "etiqueta": "Mediterránea",
      "img": "Dieta10.png"
    },
    {
      "id": "11",
      "nombre": "Dieta Rica en Fibras",
      "descripcion": "Prepara tacos de tortilla integral rellenos de frijoles cocidos, aguacate en rodajas, salsa de tomate fresco, cebolla picada y cilantro. Acompaña con una ensalada de col y zanahoria rallada aliñada con limón y aceite de oliva. Disfruta de una comida rica en fibras y nutrientes.",
      "etiqueta": "Rica en Proteínas",
      "img": "Dieta11.png"
    },
    {
      "id": "12",
      "nombre": "Dieta de la Sopa de Col",
      "descripcion": "Prepara una sopa de col con cebolla, zanahoria, apio y col cortados en trozos. Cocina en caldo de verduras hasta que estén tiernos y sazona con hierbas aromáticas como el tomillo y el orégano. Sirve caliente y disfruta de una comida reconfortante y baja en calorías.",
      "etiqueta": "Sin Gluten",
      "img": "Dieta12.png"
    },
    {
      "id": "13",
      "nombre": "Dieta Ornish",
      "descripcion": "Prepara una ensalada de garbanzos con tomates cherry cortados por la mitad, pepinos en rodajas y cebolla roja picada finamente. Aliña con una vinagreta de limón y mostaza. Sirve junto con pan integral tostado y disfruta de una comida deliciosa y saludable.",
      "etiqueta": "Mediterránea",
      "img": "Dieta13.png"
    },
    {
      "id": "14",
      "nombre": "Dieta de South Beach",
      "descripcion": "Cocina un filete de salmón a la parrilla con espárragos al vapor y puré de coliflor. Sazona el salmón con sal, pimienta y un chorrito de aceite de oliva. Sirve caliente y disfruta de una comida baja en carbohidratos y rica en nutrientes.",
      "etiqueta": "Rica en Proteínas",
      "img": "Dieta14.png"
    },
    {
      "id": "15",
      "nombre": "Dieta de la Clínica Mayo",
      "descripcion": "Cocina un filete de ternera a la parrilla con una mezcla de especias como el comino, el pimentón y el ajo en polvo. Acompaña con quinoa cocida al vapor y una guarnición de verduras salteadas con espárragos. Sirve caliente y disfruta de una comida nutritiva y satisfactoria.",
      "etiqueta": "Sin Gluten",
      "img": "Dieta15.png"
    },
    {
      "id": "16",
      "nombre": "Dieta Alcalina",
      "descripcion": "Prepara un batido verde con una base de espinacas frescas, pepino cortado en rodajas y apio picado. Agrega un puñado de hojas de menta fresca y agua de coco. Mezcla hasta obtener una consistencia suave y sirve frío. Disfruta de una bebida refrescante y alcalinizante.",
      "etiqueta": "Mediterránea",
      "img": "Dieta16.png"
    },
    {
      "id": "17",
      "nombre": "Dieta Macrobiótica",
      "descripcion": "Prepara un tazón de arroz integral cocido y sirve con una variedad de vegetales al vapor como brócoli, zanahorias y champiñones. Agrega cubos de tofu marinados en salsa de soja y jengibre rallado. Disfruta de una comida equilibrada y nutritiva.",
      "etiqueta": "Rica en Proteínas",
      "img": "Dieta17.png"
    },
    {
      "id": "18",
      "nombre": "Dieta de la Avena",
      "descripcion": "Prepara porridge (o gacha) de avena cocida en leche de almendras con una pizca de canela y una cucharadita de miel. Decora con rodajas de plátano y un puñado de nueces picadas. Sirve caliente y disfruta de un desayuno reconfortante y lleno de energía.",
      "etiqueta": "Sin Gluten",
      "img": "Dieta18.png"
    }
  ],
  "rutinas": [
    {
      "id": "1",
      "nombre": "Rutina de Fuerza",
      "descripcion": "Esta completa rutina de fuerza te guiará en la realización de ejercicios específicamente diseñados para desarrollar tu musculatura y mejorar tu fuerza general. Incorpora una variedad de movimientos clave como las sentadillas, el press de banca, las dominadas y el peso muerto, trabajando diferentes grupos musculares para lograr un equilibrio corporal óptimo. Cada sesión consta de 3-4 series con un rango de repeticiones entre 8 y 12, lo que te permite desafiar tus límites y progresar gradualmente en tus capacidades. Los descansos de 1-2 minutos entre series te permiten recuperarte adecuadamente y maximizar el rendimiento en cada ejercicio. Al seguir esta rutina de manera consistente, notarás mejoras significativas en tu fuerza y resistencia, lo que te ayudará a enfrentar cualquier desafío físico con confianza.",
      "etiqueta": "Fuerza"
    },
    {
      "id": "2",
      "nombre": "Rutina de Cardio",
      "descripcion": "Esta rutina de entrenamiento cardiovascular te ofrece una variedad de opciones para mejorar tu salud cardíaca y pulmonar mientras quemas calorías y mejoras tu resistencia. Desde correr y andar en bicicleta estática hasta saltar la cuerda y utilizar la elíptica, cada ejercicio está diseñado para mantener una intensidad moderada a alta durante 20-30 minutos. Alternar entre intervalos de alta intensidad y períodos de recuperación te ayudará a mejorar tu resistencia cardiovascular y a aumentar la eficiencia de tu entrenamiento. Además, esta rutina es perfecta para quemar grasa y mejorar tu composición corporal, lo que te ayudará a alcanzar tus objetivos de condición física de manera efectiva.",
      "etiqueta": "En Casa"
    },
    {
      "id": "3",
      "nombre": "Rutina de HIIT",
      "descripcion": "La rutina de Entrenamiento de Intervalos de Alta Intensidad (HIIT) es una forma eficaz de quemar calorías y mejorar tu condición física en poco tiempo. Incorpora una serie de ejercicios explosivos como burpees, sprints, saltos y flexiones, realizados en intervalos de trabajo cortos seguidos de períodos de descanso activo. La intensidad variable de este entrenamiento desafía tu cuerpo de manera óptima, ayudándote a mejorar tu resistencia cardiovascular, quemar grasa y aumentar tu metabolismo incluso después de haber terminado el entrenamiento. Al realizar este circuito de 3-4 veces, experimentarás un aumento en tu fuerza, resistencia y capacidad aeróbica en un tiempo reducido.",
      "etiqueta": "Flexibilidad"
    },
    {
      "id": "4",
      "nombre": "Rutina de Flexibilidad",
      "descripcion": "Esta rutina de flexibilidad está diseñada para mejorar tu amplitud de movimiento y reducir el riesgo de lesiones al realizar actividades físicas. Incorpora una combinación de ejercicios de estiramiento estático y dinámico, enfocándose en grupos musculares clave como las piernas, la espalda y los hombros. Movimientos como estocadas, estiramientos de espalda, flexiones de cadera y torsiones ayudarán a mejorar tu flexibilidad y movilidad articular. Mantén cada estiramiento durante 15-30 segundos y repite de 2 a 3 veces para obtener los mejores resultados. Al incorporar esta rutina en tu régimen de entrenamiento, notarás una mejora significativa en tu flexibilidad y una reducción en la rigidez muscular, lo que te permitirá realizar movimientos con mayor facilidad y eficacia.",
      "etiqueta": "Fuerza"
    },
    {
      "id": "5",
      "nombre": "Rutina de Entrenamiento Funcional",
      "descripcion": "La rutina de entrenamiento funcional se centra en ejercicios que imitan los movimientos naturales del cuerpo, fortaleciendo los músculos necesarios para las actividades cotidianas. Incluye una variedad de ejercicios dinámicos como sentadillas con salto, flexiones de una pierna, levantamiento de pesas rusas y giros de torso. Cada ejercicio se realiza en 3-4 series con un rango de repeticiones de 10-15, lo que te permite desarrollar fuerza, estabilidad y ​​coordinación. Esta rutina es perfecta para mejorar tu rendimiento en la vida diaria y en actividades deportivas al fortalecer los músculos de manera funcional y equilibrada.",
      "etiqueta": "En Casa"
    },
    {
      "id": "6",
      "nombre": "Rutina de Entrenamiento en Casa",
      "descripcion": "Diseñada para ser realizada en la comodidad de tu hogar con poco o ningún equipamiento, esta rutina de entrenamiento te ofrece una variedad de ejercicios efectivos para fortalecer todo el cuerpo. Desde sentadillas y flexiones hasta abdominales, planchas y saltos, cada ejercicio se realiza en 3-4 series con un rango de repeticiones de 10-15. Esta rutina es ideal para aquellos que buscan mantenerse activos y en forma sin la necesidad de ir a un gimnasio. Al seguir este programa de manera consistente, desarrollarás fuerza, resistencia y ​​flexibilidad, mejorando tu salud y bienestar en general.",
      "etiqueta": "Flexibilidad"
    },
    {
      "id": "7",
      "nombre": "Rutina de Entrenamiento de Peso Corporal",
      "descripcion": "La rutina de entrenamiento de peso corporal se basa en ejercicios que utilizan el peso del propio cuerpo como resistencia. Incluye movimientos como flexiones, dominadas, sentadillas, planchas y zancadas, diseñados para fortalecer los músculos principales y mejorar la resistencia. Cada ejercicio se realiza en 3-4 series con un rango de repeticiones de 10-15, lo que te permite adaptar la intensidad según tu nivel de condición física. Esta rutina es perfecta para aquellos que desean entrenar en cualquier lugar y en cualquier momento, sin necesidad de equipamiento adicional. Al seguir este programa de entrenamiento, notarás mejoras en tu fuerza, ​​estabilidad y ​​tono muscular.",
      "etiqueta": "Fuerza"
    },
    {
      "id": "8",
      "nombre": "Rutina de Entrenamiento de Resistencia",
      "descripcion": "La rutina de entrenamiento de resistencia está diseñada para mejorar la resistencia muscular y cardiovascular, utilizando una variedad de ejercicios que desafían tu cuerpo de manera integral. Incluye movimientos como correr, nadar, montar en bicicleta y remar, realizados en sesiones de 30-60 minutos con intensidad moderada a alta. Esta rutina es ideal para aquellos que buscan mejorar su resistencia cardiovascular, quemar calorías y aumentar la capacidad aeróbica. Al incorporar este entrenamiento de manera regular en tu rutina de ejercicios, experimentarás una mejora significativa en tu resistencia y ​​capacidad para realizar actividades físicas prolongadas con mayor facilidad.",
      "etiqueta": "En Casa"
    },
    {
      "id": "9",
      "nombre": "Rutina de Entrenamiento de Intervalos de Alta Intensidad (HIIT)",
      "descripcion": "La rutina de entrenamiento de intervalos de alta intensidad (HIIT) es un método eficaz para quemar calorías, mejorar la resistencia y aumentar el metabolismo en un corto período de tiempo. Incorpora una serie de ejercicios explosivos como burpees, sprints, saltos y flexiones, realizados en intervalos de trabajo cortos seguidos de períodos de descanso. Esta rutina desafía tu cuerpo de manera óptima, mejorando la capacidad cardiovascular y ayudándote a quemar grasa de manera eficiente. Al realizar este circuito de 3-4 veces, experimentarás un aumento en tu fuerza, resistencia y capacidad aeróbica en un tiempo reducido, lo que te ayudará a alcanzar tus objetivos de condición física de manera efectiva.",
      "etiqueta": "Flexibilidad"
    },
    {
      "id": "10",
      "nombre": "Rutina de Entrenamiento de Potencia",
      "descripcion": "La rutina de entrenamiento de potencia se enfoca en ejercicios explosivos diseñados para aumentar la fuerza y la potencia muscular. Incluye movimientos como saltos de caja, lanzamiento de balón medicinal, arrancadas y saltos con barra. Cada ejercicio se realiza en 3-4 series con un rango de repeticiones de 6-8, permitiendo un descanso completo entre series para recuperarse adecuadamente. Esta rutina es ideal para aquellos que buscan mejorar su capacidad explosiva y su fuerza funcional, lo que se traduce en un mejor rendimiento atlético y una mayor eficiencia en la realización de movimientos rápidos y poderosos.",
      "etiqueta": "Fuerza"
    },
    {
      "id": "11",
      "nombre": "Rutina de Entrenamiento de Estabilidad",
      "descripcion": "La rutina de entrenamiento de estabilidad se centra en ejercicios diseñados para mejorar el equilibrio y la estabilidad del núcleo y las articulaciones. Incluye movimientos como planchas, levantamiento de una pierna, equilibrio sobre fitball y rotaciones de torso. Cada ejercicio se realiza en 3-4 series con un rango de repeticiones de 10-15, lo que te permite fortalecer los músculos estabilizadores y mejorar la coordinación neuromuscular. Esta rutina es perfecta para aquellos que buscan mejorar su equilibrio y prevenir lesiones al realizar actividades físicas o deportivas.",
      "etiqueta": "En Casa"
    },
    {
      "id": "12",
      "nombre": "Rutina de Entrenamiento de Resistencia Muscular",
      "descripcion": "La rutina de entrenamiento de resistencia muscular está diseñada para aumentar la resistencia de los músculos a través de una serie de ejercicios desafiantes. Incluye movimientos como flexiones, sentadillas, zancadas, dominadas y abdominales, realizados en 3-4 series con un rango de repeticiones de 12-15. Al mantener un alto volumen de repeticiones y series, esta rutina te ayudará a mejorar la resistencia muscular y a aumentar la capacidad de realizar actividades físicas durante períodos prolongados. Además, fortalecerá los músculos principales de todo el cuerpo, lo que te permitirá enfrentar cualquier desafío físico con mayor facilidad.",
      "etiqueta": "Flexibilidad"
    },
    {
      "id": "13",
      "nombre": "Rutina de Entrenamiento de Movilidad",
      "descripcion": "La rutina de entrenamiento de movilidad se centra en ejercicios diseñados para mejorar la movilidad y la flexibilidad de las articulaciones. Incluye movimientos como estiramientos dinámicos, movilizaciones articulares y ejercicios de yoga, realizados en 3-4 series con un rango de repeticiones de 10-12. Esta rutina es perfecta para aquellos que desean mejorar su rango de movimiento y prevenir lesiones al realizar actividades físicas o deportivas. Al incorporar esta rutina en tu régimen de entrenamiento, experimentarás una mejora significativa en tu flexibilidad y movilidad articular, lo que te permitirá moverte con mayor facilidad y eficacia en tu vida diaria.",
      "etiqueta": "Fuerza"
    },
    {
      "id": "14",
      "nombre": "Rutina de Entrenamiento de Alta Intensidad y Baja Duración",
      "descripcion": "La rutina de entrenamiento de alta intensidad y baja duración se enfoca en ejercicios intensos durante períodos cortos de tiempo. Incluye movimientos como saltos, sprints, flexiones y sentadillas, realizados en intervalos de 20-30 segundos seguidos de 10-20 segundos de descanso. Este tipo de entrenamiento desafiante te permite maximizar el tiempo de entrenamiento y quemar calorías de manera efectiva. Al repetir el circuito de 3 a 4 veces, experimentarás mejoras significativas en tu resistencia cardiovascular, fuerza muscular y capacidad de trabajo anaeróbico.",
      "etiqueta": "En Casa"
    },
    {
      "id": "15",
      "nombre": "Rutina de Entrenamiento de Hipertrofia",
      "descripcion": "La rutina de entrenamiento de hipertrofia está diseñada específicamente para aumentar el tamaño y la fuerza de los músculos. Incluye ejercicios como press de banca, curls de bíceps, extensiones de tríceps y sentadillas, realizados en 3-4 series con un rango de repeticiones de 8-12. Este enfoque de entrenamiento de alta intensidad y volumen provoca microlesiones en las fibras musculares, lo que estimula el crecimiento muscular. Al seguir esta rutina de manera consistente y complementarla con una nutrición adecuada, experimentarás un aumento significativo en la masa muscular y la fuerza general.",
      "etiqueta": "Flexibilidad"
    },
    {
      "id": "16",
      "nombre": "Rutina de Entrenamiento de Equilibrio",
      "descripcion": "La rutina de entrenamiento de equilibrio se centra en ejercicios diseñados para mejorar la estabilidad y la coordinación. Incluye movimientos como equilibrio sobre una pierna, ejercicios con bosu, saltos laterales y movimientos de brazos y piernas, realizados en 3-4 series con un rango de repeticiones de 10-15. Este tipo de entrenamiento ayuda a fortalecer los músculos estabilizadores y mejora la propriocepción, lo que reduce el riesgo de lesiones y mejora el rendimiento en actividades deportivas y cotidianas que requieren equilibrio y coordinación.",
      "etiqueta": "Fuerza"
    },
    {
      "id": "17",
      "nombre": "Rutina de Entrenamiento de Agilidad",
      "descripcion": "La rutina de entrenamiento de agilidad se enfoca en ejercicios diseñados para mejorar la rapidez de movimientos y la capacidad de cambiar de dirección rápidamente. Incluye movimientos como cambios de dirección, saltos a una pierna, ejercicios de slalom y sprints cortos, realizados en 3-4 series con un rango de repeticiones de 10-15. Este tipo de entrenamiento ayuda a mejorar la capacidad de reacción, la coordinación y la velocidad, lo que es beneficioso tanto para atletas como para personas que buscan mejorar su agilidad en la vida diaria.",
      "etiqueta": "En Casa"
    },
    {
      "id": "18",
      "nombre": "Rutina de Entrenamiento de Plyometrics",
      "descripcion": "La rutina de entrenamiento de plyometrics se enfoca en ejercicios explosivos diseñados para mejorar la potencia y la explosividad muscular. Incluye movimientos como saltos en caja, saltos de rana, saltos con cuerda y burpees, realizados en 3-4 series con un rango de repeticiones de 8-10. Este tipo de entrenamiento involucra estiramientos rápidos seguidos de contracciones musculares potentes, lo que mejora la capacidad de generar fuerza en un período corto de tiempo. Al incorporar esta rutina en tu entrenamiento, experimentarás mejoras significativas en la capacidad de salto, la velocidad y la fuerza explosiva.",
      "etiqueta": "Flexibilidad"
    }
  ],
  "alimentos": [
    {
      "id": "1",
      "nombre": "Manzana",
      "kcal_por_cada_100gr": 52
    },
    {
      "id": "2",
      "nombre": "Banana",
      "kcal_por_cada_100gr": 89
    },
    {
      "id": "3",
      "nombre": "Arroz",
      "kcal_por_cada_100gr": 130
    },
    {
      "id": "4",
      "nombre": "Pasta",
      "kcal_por_cada_100gr": 131
    },
    {
      "id": "5",
      "nombre": "Pollo",
      "kcal_por_cada_100gr": 165
    },
    {
      "id": "6",
      "nombre": "Carne de res",
      "kcal_por_cada_100gr": 250
    },
    {
      "id": "7",
      "nombre": "Pescado",
      "kcal_por_cada_100gr": 206
    },
    {
      "id": "8",
      "nombre": "Huevos",
      "kcal_por_cada_100gr": 155
    },
    {
      "id": "9",
      "nombre": "Leche",
      "kcal_por_cada_100gr": 42
    },
    {
      "id": "10",
      "nombre": "Queso",
      "kcal_por_cada_100gr": 402
    },
    {
      "id": "11",
      "nombre": "Yogurt",
      "kcal_por_cada_100gr": 59
    },
    {
      "id": "12",
      "nombre": "Espinacas",
      "kcal_por_cada_100gr": 23
    },
    {
      "id": "13",
      "nombre": "Brócoli",
      "kcal_por_cada_100gr": 34
    },
    {
      "id": "14",
      "nombre": "Zanahorias",
      "kcal_por_cada_100gr": 41
    },
    {
      "id": "15",
      "nombre": "Tomates",
      "kcal_por_cada_100gr": 18
    },
    {
      "id": "16",
      "nombre": "Fresas",
      "kcal_por_cada_100gr": 32
    },
    {
      "id": "17",
      "nombre": "Naranjas",
      "kcal_por_cada_100gr": 47
    },
    {
      "id": "18",
      "nombre": "Plátanos",
      "kcal_por_cada_100gr": 89
    },
    {
      "id": "19",
      "nombre": "Almendras",
      "kcal_por_cada_100gr": 579
    },
    {
      "id": "20",
      "nombre": "Papas",
      "kcal_por_cada_100gr": 77
    }
  ]
}